Catalogs/DMS_БизнесРегионы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_БизнесРегионы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеГеографическогоРегиона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГеографическийРегион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/DMS_БизнесРегионы/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьВсеРегионы(Команда)
	
	ЗаполнитьВсеРегионыНаСервере();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьВсеРегионыНаСервере()
	
	ГеоСхема = Справочники.DMS_БизнесРегионы.ПолучитьМакет("ГеографическаяСхемаРоссияРегионыИВсеГорода");
	
	ЗаполнитьОбъектыГеоСхемы(ГеоСхема);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьОбъектыГеоСхемы(ГеоСхема)
	
	ВыбиратьГорода = Ложь; // Города будут выбраны только для схемы регионов России со всеми городами
	Если ГеоСхема.Слои.Найти("Регионы России") <> Неопределено
		И ГеоСхема.Слои.Найти("Города") <> Неопределено Тогда
		Города = ГеоСхема.Слои.Города;
		НеСтолицы = Города.ВыбратьОбъекты(Новый Структура(Города.Серии.Столица.Имя, Ложь));
		Если НеСтолицы.Количество() Тогда
			ВыбиратьГорода = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Дерево = Новый ДеревоЗначений;
	
	Массив = Новый Массив;
	КС = Новый КвалификаторыСтроки(255);
	Массив.Добавить(Тип("Строка"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
	Дерево.Колонки.Добавить("НазваниеГеографическогоРегиона", ОписаниеТипов);
	КЧ = Новый КвалификаторыЧисла(25,0);
	Массив.Добавить(Тип("Число"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КЧ, КС);
	Дерево.Колонки.Добавить("ЗначениеГеографическогоРегиона", ОписаниеТипов);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Булево"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив, , );
	Дерево.Колонки.Добавить("Пометка", ОписаниеТипов);
	
	
	Слой = ГеоСхема.Слои[0];
	
	ЕстьСерияНазвание = Ложь;
	СерияНазвание = Слой.Серии.Найти("Название");
	Если СерияНазвание <> Неопределено Тогда
		ЕстьСерияНазвание = Истина;
	КонецЕсли;
	
	Для каждого Объект Из Слой.Объекты Цикл
		
		НовыйРегион = Дерево.Строки.Добавить();
		Если ЕстьСерияНазвание Тогда
			НазваниеОбъекта = Слой.ПолучитьЗначение(Объект, СерияНазвание);
			НовыйРегион.НазваниеГеографическогоРегиона = НазваниеОбъекта.Значение;
			НовыйРегион.ЗначениеГеографическогоРегиона = Объект.Значение;
		Иначе
			НовыйРегион.НазваниеГеографическогоРегиона = Объект.Значение;
			НовыйРегион.ЗначениеГеографическогоРегиона = Объект.Значение;
		КонецЕсли;
		
		Если ВыбиратьГорода Тогда
			ЕстьСерияНазваниеГорода = Ложь;
			СерияНазваниеГорода = Города.Серии.Найти("Название");
			Если СерияНазваниеГорода <> Неопределено Тогда
				ЕстьСерияНазваниеГорода = Истина;
			КонецЕсли;
			
			ГородаРегиона = Города.ВыбратьОбъекты(Новый Структура(Города.Серии.КОД_КЛАДР_РЕГИОНА.Имя, Объект.Значение));
			Для каждого ГородРегиона из ГородаРегиона Цикл
				НовыйГород = НовыйРегион.Строки.Добавить();
				Если ЕстьСерияНазваниеГорода Тогда
					НазваниеГорода = Города.ПолучитьЗначение(ГородРегиона, СерияНазваниеГорода);
					НовыйГород.НазваниеГеографическогоРегиона = НазваниеГорода.Значение;
					НовыйГород.ЗначениеГеографическогоРегиона = ГородРегиона.Значение;
				Иначе
					НовыйГород.НазваниеГеографическогоРегиона = ГородРегиона.Значение;
					НовыйГород.ЗначениеГеографическогоРегиона = ГородРегиона.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Дерево.Строки.Сортировать("НазваниеГеографическогоРегиона", Истина);
	
	ЗаполнитьБизнесРегионы(Дерево);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьБизнесРегионы(ДеревоРегионов)
	
	ЧислоНовыхРегионов = 0;
	
	СписокРегионов = ДеревоРегионов.Строки.НайтиСтроки(Новый Структура("Пометка", Ложь), Истина);
	
	Для каждого Регион из СписокРегионов Цикл
		БизнесРегион = НайтиБизнесРегион(Регион.ЗначениеГеографическогоРегиона, Регион.НазваниеГеографическогоРегиона);
		Если БизнесРегион = Справочники.DMS_БизнесРегионы.ПустаяСсылка() Тогда
			НовыйБизнесРегион = Справочники.DMS_БизнесРегионы.СоздатьЭлемент();
			НовыйБизнесРегион.Наименование = Регион.НазваниеГеографическогоРегиона;
			НовыйБизнесРегион.ГеографическийРегион = Регион.НазваниеГеографическогоРегиона;
			НовыйБизнесРегион.ЗначениеГеографическогоРегиона = Регион.ЗначениеГеографическогоРегиона;
			Если Регион.Родитель <> Неопределено Тогда
				РегионРодитель = НайтиБизнесРегион(Регион.Родитель.ЗначениеГеографическогоРегиона,
					Регион.Родитель.НазваниеГеографическогоРегиона);
				НовыйБизнесРегион.Родитель = РегионРодитель;
			КонецЕсли;
			НовыйБизнесРегион.Записать();
			ЧислоНовыхРегионов = ЧислоНовыхРегионов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЧислоНовыхРегионов;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиБизнесРегион(ЗначениеГеографическогоРегиона, ГеографическийРегион)
	
	НайденныйБизнесРегион = Справочники.DMS_БизнесРегионы.ПустаяСсылка();
	
	НайденныйБизнесРегион = Справочники.DMS_БизнесРегионы.НайтиПоРеквизиту("ЗначениеГеографическогоРегиона", ЗначениеГеографическогоРегиона);
	
	Если НайденныйБизнесРегион = Справочники.DMS_БизнесРегионы.ПустаяСсылка() Тогда
		НайденныйБизнесРегион = Справочники.DMS_БизнесРегионы.НайтиПоНаименованию(ГеографическийРегион, Истина);
	КонецЕсли;
	
	Возврат НайденныйБизнесРегион;

КонецФункции
